Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: For more information about using arrays, see Array and ContiguousArray, with which ArraySlice shares most properties and methods.
ja: 配列の使用についてのさらなる情報として、ArrayとContiguousArrayを見てください、それらとArraySliceはほとんどのプロパティとメソッドを共有します。

source: For more information, see Ownership Policy in Memory Management Programming Guide for Core Foundation.
ja: 更なる情報のために、Ownership PolicyをMemory Management Programming Guide for Core Foundationで見てください。

source: For more information, see the DefaultStringInterpolation and StringInterpolationProtocol documentation.
ja: さらなる情報として、DefaultStringInterpolationとStringInterpolationProtocol文書化を見てください。

source: For more information, see the StringInterpolationProtocol documentation.
ja: さらなる情報として、StringInterpolationProtocolの文書化を見てください。

source: For most numbers x, this is the difference between x and the next greater (in magnitude) representable number.
ja: ほとんどの数xに対して、これはxと次の（規模における）より大きい表現可能な数との間の差異です。

source: For other collections the counters may be out of range or of the wrong type to use as an index.
ja: 他のコレクションに対してこれらのカウンタは、インデックスとして使うのには範囲外または間違った型になるでしょう。

source: For other values of x, x.significand is defined as follows:
ja: 別の値xに対して、x.significandは次のように定義されます：

source: For performance reasons, the size of the newly allocated storage might be greater than the requested capacity.
ja: 性能上の理由から、新しく割り当てられたストレージは要請された容量より大きいかもしれません。

source: For pointers to untyped, raw memory, the following mappings apply:
ja: 型無しの、生のメモリへのポインタに対して、以下のマッピングを適用します：

source: For return types, variables, and arguments, the following mappings apply:
ja: 戻り型、変数、そして引数のために、以下のマッピングが適用されます：

source: For signed integer types, this value is (2 ** (bitWidth - 1)) - 1, where ** is exponentiation.
ja: 符号付き整数型に対して、この値は(2 ** (bitWidth - 1)) - 1です、そこで**は冪演算です。

source: For signed integer types, this value is -(2 ** (bitWidth - 1)), where ** is exponentiation.
ja: 符号付き整数型に対して、この値は-(2 ** (bitWidth - 1))です、そこで**は冪演算です。

source: For signed integer types, this value is (2 ** (bitWidth - 1)) - 1.
ja: 符号付き整数型に対して、この値は(2 ** (bitWidth - 1)) - 1です。

source: For simple types such as integers and other structures, this means that when you change a value in one array, the value of that element does not change in any copies of the array.
ja: 例えば整数および他の構造体のような単純な型にとって、これは、あなたがある配列の中のある値を変更する場合、その要素の値はその配列の何らかのコピーにおいては変化しないことを意味します。

source: For structs whose stored properties are all Hashable, and for enum types that have all-Hashable associated values, the compiler is able to provide an implementation of hash(into:) automatically.
ja: それらの格納プロパティが全てHashableであるstructに対して、そして全てHashable関連値を持つenum型に対して、コンパイラはhash(into:)の実装を自動的に提供可能です。

source: For tasks that need to handle cancellation by throwing an error, use the withThrowingTaskGroup(of:returning:body:) method instead.
ja: エラーをスローすることによって取り消しを取り扱う必要があるタスクのために、withThrowingTaskGroup(of:returning:body:)メソッドを代わりに使ってください。

source: For this reason, imported Objective-C types frequently use AnyObject as the type for properties, method parameters, and return values.
ja: この理由から、インポートされたObjective-C型はしばしばAnyObjectをプロパティ、メソッドパラメータ、そして戻り値の型として使います。

source: For this reason, the first operation that uses the contents of the dictionary may take O(n).
ja: この理由のために、辞書の内容を使う最初の演算はO(n)をとるでしょう。

source: For this reason, you should almost never need to use a bridged reference type directly in your own code.
ja: この理由のために、あなたはブリッジ参照型を直接にあなた自身のコードにおいて使う必要はほとんどないはずです。

source: For two finite values x and y, the remainder r of dividing x by y satisfies x == y * q + r, where q is the integer nearest to x / y.
ja: ２つの有限値xとyに対して、xをyで割った余りrはx == y * q + rを満足させます、ここでqはx / yに最も近い整数です。

source: For two integers a and b, a is a multiple of b if there exists a third integer q such that a = q*b.
ja: ２つの整数aとbに対して、aはbの倍数です、もし第３の整数qが存在して、a = q*bであるようなところでは。

source: For two tuples to compare as equal, each corresponding pair of components must be equal.
ja: ２つのタプルが等しいと比較されるには、対応する構成要素同士がそれぞれ等しくなければなりません。

source: For two values x and y, and a distance n = x.distance(to: y), x.advanced(by: n) == y.
ja: ２つの値xとy、そして隔たりn = x.distance(to: y)に対して、x.advanced(by: n) == y。

source: For two values x and y, the result of maximum(x, y) is x if x > y, y if x <= y, or whichever of x or y is a number if the other is a quiet NaN.
ja: ２つの値xとyに対して、maximum(x, y)の結果はx > yならばx、x <= yならばy、または他のものがクワイエットNaNならばxかyどちらか数である方です。

source: For two values x and y, the result of maximumMagnitude(x, y) is x if x.magnitude > y.magnitude, y if x.magnitude <= y.magnitude, or whichever of x or y is a number if the other is a quiet NaN.
ja: ２つの値xとyに対して、maximumMagnitude(x, y)の結果は、x.magnitude > y.magnitudeならばx、x.magnitude <= y.magnitudeならばy、または他のものがクワイエットNaNならばxかyどちらか数である方です。

source: For two values x and y, the result of minimum(x, y) is x if x <= y, y if y < x, or whichever of x or y is a number if the other is a quiet NaN.
ja: ２つの値xとyに対して、minimum(x, y)の結果はx <= yならばx、y < xならばy、または他のものがクワイエットNaNならばxかyどちらか数である方です。

source: For two values x and y, the result of minimumMagnitude(x, y) is x if x.magnitude <= y.magnitude, y if y.magnitude < x.magnitude, or whichever of x or y is a number if the other is a quiet NaN.
ja: ２つの値xとyに対して、minimumMagnitude(x, y)の結果はx.magnitude <= y.magnitudeならばx、y.magnitude < x.magnitudeならばy、または他のものがクワイエットNaNならばxかyどちらか数である方です。

source: For unsigned integer types, this value is (2 ** bitWidth) - 1, where ** is exponentiation.
ja: 符号なし整数型に対して、この値は(2 ** bitWidth) - 1です、そこで**は冪演算です。

source: For unsigned integer types, this value is always 0.
ja: 符号なし整数型に対して、この値は常に0です。

source: For value equality, see the equal-to operator (==) and the Equatable protocol.
ja: 値の同等性については、同等演算子（==）そしてEquatableプロトコルを見てください。

source: For value inequality, see the not-equal-to operator (!=) and the Equatable protocol.
ja: 値の不等性については、不等演算子（!=）そしてEquatableプロトコルを見てください。

source: For values x and y and their truncated integer quotient q, the remainder r satisfies x == y * q + r.
ja: 値xとyおよび切り捨てられる整数指数qに対して、余りrはx == y * q + rを満足させます。

source: Forward declarations of Swift classes and protocols can be used only as types for method and property declarations.
ja: Swiftのクラスとプロトコルの前方宣言は、メソッドおよびプロパティ宣言に対する型としてのみ使われることができます。

source: Foundation
ja: ファウンデーション

source: Foundation classes often declare enumeration or constant types.
ja: Foundationクラスは、しばしば列挙や定数型を宣言します。

source: Framework
ja: フレームワーク

source: From Protocol
ja: 由来プロトコル

source: Function
ja: 関数

source: Further modifications to numbers are made in place, while the two copies continue to share the original storage.
ja: numbersへの以降の修正は、そこでなされます、一方２つのコピーは元々のストレージの共有を続けます。

source: Generally, a Character instance matches what the reader of a string will perceive as a single character.
ja: 一般的に、あるCharacterインスタンスがマッチするのは、ある文字列の読み手が単一の文字と知覚するものです。

source: Generally, native Swift types that do not contain strong or weak references are trivial, as are imported C structs and enums.
ja: 一般に、生粋のSwift型で強いまたは弱い参照を含まないものは自明です、インポートされたCのstructとenumのように。

source: Generic Instance Method
ja: 総称体インスタンスメソッド

source: Generic Type Alias
ja: 総称体型エイリアス

source: Getting and Setting Dictionary Values
ja: 辞書の値の取得と設定

source: Given the Counter sequence from the previous example, you can test for the existence of a sequence member with a one-line call:
ja: 以前の例からのCounterシーケンスを与えられて、あなたはあるシーケンスメンバーの存在を一行呼び出しで試験できます：

source: Given two tuples (a1, a2, ..., aN) and (b1, b2, ..., bN), the first tuple is after or the same as the second tuple if and only if a1 > b1 or (a1 == b1 and (a2, ..., aN) >= (b2, ..., bN)).
ja: ２つのタプル(a1, a2, ..., aN)と(b1, b2, ..., bN)を与えられて、最初のタプルが２番目のタブルより後かそれと同じであるのは、a1 > b1または(a1 == b1および(a2, ..., aN) >= (b2, ..., bN))である場合に限ります。

source: Given two tuples (a1, a2, ..., aN) and (b1, b2, ..., bN), the first tuple is after the second tuple if and only if a1 > b1 or (a1 == b1 and (a2, ..., aN) > (b2, ..., bN)).
ja: ２つのタプル(a1, a2, ..., aN)と(b1, b2, ..., bN)を与えられて、最初のタプルが２番目のタブルより後であるのは、a1 > b1または(a1 == b1および(a2, ..., aN) > (b2, ..., bN))である場合に限ります。

source: Given two tuples (a1, a2, ..., aN) and (b1, b2, ..., bN), the first tuple is before or the same as the second tuple if and only if a1 < b1 or (a1 == b1 and (a2, ..., aN) <= (b2, ..., bN)).
ja: ２つのタプル(a1, a2, ..., aN)と(b1, b2, ..., bN)を与えられて、最初のタプルが２番目のタブルより前かそれと同じであるのは、a1 < b1または(a1 == b1および(a2, ..., aN) <= (b2, ..., bN))である場合に限ります。

source: Given two tuples (a1, a2, ..., aN) and (b1, b2, ..., bN), the first tuple is before the second tuple if and only if a1 < b1 or (a1 == b1 and (a2, ..., aN) < (b2, ..., bN)).
ja: ２つのタプル(a1, a2, ..., aN)と(b1, b2, ..., bN)を与えられて、最初のタプルが２番目のタブルより後であるのは、a1 < b1または(a1 == b1 and (a2, ..., aN) < (b2, ..., bN))である場合に限ります。

source: Global Numeric Functions
ja: グローバルな数値関数

source: Growing the Size of an Array
ja: 配列の大きさの増大

source: Guaranteed always unique (e.g. UUIDs).
ja: 常に特有であると保証される（たとえば、UUID）。

source: Handle Exceptions in Objective-C Only
ja: Objective-Cにだけしかない例外を処理する

source: Handling Cocoa Errors in Swift
ja: CocoaエラーをSwiftにおいて処理する

source: Handling Dynamically Typed Methods and Objects in Swift
ja: 動的に型付メソッドとオブジェクトをSwiftにおいて取り扱う

source: Hash values are not guaranteed to be equal across different executions of your program.
ja: ハッシュ値は、あなたのプログラムの異なる実行をまたいで等しいことを保証されません。

source: Hashes the elements of the vector using the given hasher.
ja: ベクターの要素をこの与えられたハーシャーを使ってハッシュ化します。

source: Hashes the essential components of this value by feeding them into the given hasher.
ja: この値の本質的な構成要素を、それらをその与えられたhasherへと与えることによって、ハッシュ化します。

source: Hashing a value means feeding its essential components into a hash function, represented by the Hasher type.
ja: ある値をハッシュ化することは、それの本質的な構成要素を、Hasher型によって表される、ハッシュ関数へと投入することを意味します。

source: Here's how you handle the same error in Swift:
ja: ここに、あなたが同じエラーをSwiftで処理する方法があります：

source: Here, an array of strings is created from an array literal holding only strings.
ja: ここでは、文字列からなる配列が、文字列だけを保持している配列リテラルから作成されます。

source: Here, an array of strings is created from an array literal holding only strings:
ja: ここでは、文字列の配列が、文字列だけを保持する配列リテラルから作成されます：

source: Here, the value for the key "Coral" is updated from 16 to 18 and a new key-value pair is added for the key "Cerise".
ja: ここでは、キー"Coral"に対する値が16から18に更新され、そして新しいキー値ペアがキー"Cerise"に対して加えられます。

source: Here’s an example of a type that declares the minimal requirements for a collection.
ja: ここにある型の例があります、それはあるコレクションのための最小限の要件を宣言します。

source: Here’s an example of accessing the first character in a string through its subscript:
ja: ここにあるのはある文字列の最初の文字にそれの添え字を通してアクセスする例です。

source: Here’s an example of creating a set and an array using array literals:
ja: ここに配列リテラルを使って集合と配列を作成する例があります：

source: Here’s an example of creating an array initialized with five strings containing the letter Z.
ja: ここに、字Zを含んでいる５つの文字列で初期化される配列を作成する例があります。

source: Here’s an example of how you handle an error when calling a method in Objective-C:
ja: ここに、メソッドをObejctive-Cにおいて呼び出す時に、あなたがエラーを処理する方法の例があります：

source: Here’s an example of inserting a range of integers into an array of the same type:
ja: ここに整数の範囲を同じ型の配列へ挿入する例があります：

source: Here’s an example of sorting a list of students’ names.
ja: ここに、生徒名のリストをソートする例があります。

source: Here’s an example of the number -8.5 represented as an instance of the Double type, which defines a radix of 2.
ja: ここにDouble型のあるインスタンスとして表される数-8.5の例があります、それは２の基数を定義します。

source: Here’s an example that finds a student name that begins with the letter “A”:
ja: ここに、文字「A」で始まる生徒名を見つける例があります：

source: Here’s an implementation of those steps:
ja: ここにこれらの手順の実装があります：

source: Here’s how Swift imports them:
ja: ここにどのようにスウィフトがそれらをインポートするかがあります：

source: Here’s how you can catch any XMLParsingError errors thrown by the parse(_:) function:
ja: ここにあるのは、あなたがparse(_:)関数によってスローされる何らかのXMLParsingErrorエラーを捕まえる方法です：

source: Here’s how you would create a dictionary of HTTP response codes and their related messages:
ja: ここにあるのは、あなたがHTTP応答コードとそれらの関連メッセージの辞書を作成する方法です：

source: Here’s the Swift version of those declarations when you import them:
ja: ここに、あなたがそれらをインポートする場合のSwiftバージョンのそれら宣言があります：

source: Here’s the definition for IntegerRef and the == function that makes it conform to Equatable:
ja: ここにIntegerRefとそれをEquatableに準拠させる==関数の定義があります：

source: Here’s the initial declaration of the GridPoint type:
ja: ここにGridPoint型の初期宣言があります：

source: Here’s the initial declaration of the StreetAddress type:
ja: ここにStreetAddress型の初期宣言があります：

source: Hexadecimal digits include 0-9, Latin letters a-f and A-F, and their fullwidth compatibility forms.
ja: 16進法桁は、0-9、Latin文字 a-f および A-F、そしてそれらの全角互換形式を含みます。

source: Historically “epsilon” has been used to refer to several different concepts in different languages, leading to confusion and bugs.
ja: 歴史的に “イプシロン” は、異なる言語でいくつかの異なる概念に言及するのに使われていて、混乱とバグに通じます。

source: However if you call this function from the body of a synchronous function, and that function isn’t executing in the context of any task, the unsafe task handle is nil.
ja: しかしながら、あなたがこの関数を同期関数の本体から呼び出すならば、そしてその関数が何らかのタスクの文脈において遂行していないならば、非安全タスクハンドルはnilです。

source: However, because the Any type can refer to any type, a downcast to a more specific type isn't guaranteed by the compiler to succeed.
ja: しかしながら、Any型がどんな型でも参照できることから、より具体的な型へのダウンキャストはコンパイラによって成功することが保証されません。

source: However, because the caller must potentially wait for values, you use the await keyword.
ja: しかしながら、呼び出し側が潜在的に値それらに対して待機することから、あなたはawaitキーワードを使います。

source: However, during development, the ability to verify that the invariants are being upheld in testing is important.
ja: しかしながら、開発の間は、試験することで不変式それらが支持されていることを検証できることは重要です。

source: However, if a forced downcast fails, a runtime error is triggered:
ja: しかしながら、強制型キャストが失敗するならば、実行時エラーが引き起こされます：

source: However, if two arrays contain references to the same object, you can observe changes to that object’s properties from both arrays.
ja: しかしながら、２つの配列が同じオブジェクトへの参照を含むならば、あなたは両方の配列からそのオブジェクトの持つプロパティへの変更を観察するでしょう。

source: However, if you call next() in the task group and propogate its error, all other tasks are canceled.
ja: しかしながら、あなたがnext()をタスクグループの中で呼び出してそしてそれのエラーを伝播するならば、全ての他のタスクは取り消されます。

source: However, if you pass 19 as rhs, the method first bitmasks rhs to 3, and then uses that masked value as the number of bits to shift lhs.
ja: しかしながら、あなたが19をrhsとして渡すならば、このメソッドは最初にrhsを3にビットマスクして、それからそのマスクされた値をビット数として使うことでlhsをシフトします。

source: However, if you use 19 as rhs, the operation first bitmasks rhs to 3, and then uses that masked value as the number of bits to shift lhs.
ja: しかしながら、あなたが19をrhsとして使うならば、この演算は最初にrhsを3にビットマスクして、それからそのマスクされた値をビット数として使うことでlhsをシフトします。

source: However, if you use 8 as the shift amount, the method first masks the shift amount to zero, and then performs the shift, resulting in no change to the original value.
ja: しかしながら、あなたが8をシフト量として使うならば、メソッドは最初にそのシフト量をマスクしてゼロにして、それからシフトを実行して、元の値に対して変更しないという結果になります。

source: However, in Swift, it’s imported as two methods:
ja: しかしながら、Swiftでは、それは２つのメソッドとしてインポートされます：

source: However, macros can make debugging and refactoring difficult.
ja: しかし、マクロはデバッグやリファクタリングを難しくすることがあります。

source: However, the kinds of inheritance hierarchies you can build with class inheritance can be also modeled using protocol inheritance and structures.
ja: しかしながら、あなたがクラス継承で構築できる種類の継承階層はまた、プロトコル継承と構造体を使ってモデル化できます。

source: However, the underlying hash algorithm is designed to exhibit avalanche effects: slight changes to the seed or the input byte sequence will typically produce drastic changes in the generated hash value.
ja: しかしながら、基礎をなすハッシュアルゴリズムは、雪崩効果を示すように設計されます：そのシードまたは入力バイト列に対するわずかな変更は、概して生成されたハッシュ値に徹底的な変化を生じさせます。

source: However, there’s no safe way to recover from Objective-C exceptions in Swift.
ja: しかしながら、スウィフトにはObjective-C例外から回復する安全な方法はありません。

source: However, they're inaccessible at compile time and don't appear in the generated header for a framework target.
ja: しかしながら、それらはコンパイル時にはアクセス不可能です、そしてフレームワークターゲットに対する生成ヘッダの中に現れません。

source: However, when the closure receives 4, it throws an error, terminating the sequence.
ja: しかしながら、クロージャが4を受け取る場合、それはシーケンスを終端して、エラーをスローします。

source: Identifiable Implementations
ja: Identifiableの実装

source: Identities could be any of the following:
ja: 同一性は、以下のどれかでありえます：

source: If areEquivalent(a, b) and areEquivalent(b, c) are both true, then areEquivalent(a, c) is also true.
ja: areEquivalent(a, b)とareEquivalent(b, c)が両方ともtrueならば、そのときareEquivalent(a, c)もまたtrueである。

source: If areInIncreasingOrder(a, b) and areInIncreasingOrder(b, c) are both true, then areInIncreasingOrder(a, c) is also true.
ja: areInIncreasingOrder(a, b)とareInIncreasingOrder(b, c)が両方ともtrueならば、そのときareInIncreasingOrder(a, c)もまたtrueである。

source: If bitPattern is zero, the result is nil.
ja: bitPatternがゼロならば、結果はnilです。

source: If description is in an invalid format, or if the value it denotes in base 10 is not representable, the result is nil.
ja: descriptionが無効な形式になっているならば、またはそれが底10で示す値が表現可能でないならば、結果はnilです。

source: If distance > 0, limit has no effect if it is less than i.
ja: distance > 0ならば、limitはそれがiより少ないならば効果を持ちません。

source: If distance > 0, limit should be greater than i to have any effect.
ja: distance > 0ならば、limitが何らかの効果を持つにはiより大きくなければなりません。

source: If distance > 0, a limit that is less than i has no effect.
ja: distance > 0ならば、iより少ない限度は効果を持ちません。

source: If end is equal to start, the result is zero.
ja: endがstartに等しいならば、結果はゼロです。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the collection and for each instance of separator at the start or end of the collection.
ja: falseならば、このコレクション中の連続するseparator要素の対それぞれに、そしてコレクションの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the sequence and for each instance of separator at the start or end of the sequence.
ja: falseならば、このシーケンス中の連続するseparator要素の対それぞれに、そしてシーケンスの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the collection satisfying the isSeparator predicate.
ja: falseならば、結果においてisSeparator述部を満たす隣接する要素のペアそれぞれに対しておよびisSeparator述部を満たすコレクションの始まりまたは終わりでの要素それぞれに対して１つの空の下位シーケンスが返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the sequence satisfying the isSeparator predicate.
ja: falseならば、結果においてisSeparator述部を満たす隣接する要素のペアそれぞれに対しておよびisSeparator述部を満たすシーケンスの始まりまたは終わりでの要素それぞれに対して１つの空の下位シーケンスが返されます。

source: If from is nil, the result of this initializer is nil.
ja: fromがnilならば、このイニシャライザの結果は、nilです。

source: If i > c.startIndex && i <= c.endIndex c.index(after: c.index(before: i)) == i.
ja: i > c.startIndex && i <= c.endIndexならばc.index(after: c.index(before: i)) == i。

source: If i >= c.startIndex && i < c.endIndex, c.index(before: c.index(after: i)) == i.
ja: i >= c.startIndex && i < c.endIndexならば、c.index(before: c.index(after: i)) == i。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original collection containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元コレクションの後ろ部分です。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original sequence containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元シーケンスの後ろ部分です。

source: If n > 0, a limit that is less than i has no effect.
ja: n > 0ならば、iより少ない限度は効果を持ちません。

source: If other can’t be represented as an instance of Double without rounding, the result of this initializer is nil.
ja: otherがDoubleのインスタンスとして表されることが丸めることなしには可能でないならば、このイニシャライザの結果はnilです。

source: If other can’t be represented as an instance of Float16 without rounding, the result of this initializer is nil.
ja: otherがFloat16のインスタンスとして表されることが丸めることなしには可能でないならば、このイニシャライザの結果はnilです。

source: If other can’t be represented as an instance of Float80 without rounding, the result of this initializer is nil.
ja: otherがFloat80のインスタンスとして表されることが丸めることなしには可能でないならば、このイニシャライザの結果はnilです。

source: If other can’t be represented as an instance of Float without rounding, the result of this initializer is nil.
ja: otherがFloatのインスタンスとして表されることが丸めることなしには可能でないならば、このイニシャライザの結果はnilです。

source: If other is nil, the result is nil.
ja: otherがnilならば、結果は、nilです。

source: If predicate matches every element in the sequence, the result is an empty sequence.
ja: predicateがシーケンスの中のすべての要素に合致するならば、結果は空のシーケンスです。

source: If predicate matches every element in the sequence, the resulting sequence contains every element of the sequence.
ja: predicateがシーケンスの中のすべての要素に合致するならば、結果のシーケンスはそのシーケンスのすべての要素を含みます。

source: If resume(throwing:) is called on the continuation, this function throws that error.
ja: resume(throwing:)が継続上で呼び出されるならば、この関数はそのエラーをスローします。

source: If source is outside the bounds of this type after rounding toward zero, a runtime error may occur.
ja: sourceがゼロへの丸め後にこの型の境界の外側ならば、実行時エラーが起こるかもしれません。

source: If text is in an invalid format or contains characters that are out of bounds for the given radix, or if the value it denotes in the given radix is not representable, the result is nil.
ja: text が無効な形式になっているか指定radixの領域外の文字列を含むならば、または指定radixにおいてそれが意味する値が表現可能でないならば、結果はnilです。

source: If true, newline characters and character combinations are stripped from the result; otherwise, newline characters or character combinations are preserved.
ja: trueならば、改行文字および文字組み合わせは結果から剥ぎ取られます；そうでなければ、改行文字および文字組み合わせは保全されます。

source: If userPrefs[greetingKey] has a value, that value is assigned to greeting.
ja: userPrefs[greetingKey]が値を持つならば、その値はgreetingに割り当てられます。

source: If x is +/-infinity or NaN, then x.exponent is Int.max
ja: xが+/-infinityまたはNaNならば、そのときx.exponentはInt.maxです

source: If x is 10, x.significand is 1.01 in binary, so x.significandWidth is 2.
ja: xが10ならば、x.significandは２進数で1.01です、それでx.significandWidthは２です。

source: If x is -greatestFiniteMagnitude, then x.nextDown is -infinity.
ja: xが-greatestFiniteMagnitudeならば、そのときx.nextDownは-infinityです。

source: If x is -infinity, then x.nextUp is -greatestFiniteMagnitude.
ja: xが-infinityならば、そのときx.nextUpは-greatestFiniteMagnitudeです。

source: If x is -leastNonzeroMagnitude, then x.nextUp is -0.0.
ja: xが-leastNonzeroMagnitudeならば、そのときx.nextUpは-0.0です。

source: If x is greatestFiniteMagnitude, then x.nextUp is infinity.
ja: xがgreatestFiniteMagnitudeならば、そのときx.nextUpはinfinityです。

source: If x is infinity, then x.nextDown is greatestFiniteMagnitude.
ja: xがinfinityならば、そのときx.nextDownはgreatestFiniteMagnitudeです。

source: If x is leastNonzeroMagnitude, then x.nextDown is 0.0.
ja: xがleastNonzeroMagnitudeならば、そのときx.nextDownは0.0です。

source: If x is Float.pi, x.significand is 1.10010010000111111011011 in binary, and x.significandWidth is 23.
ja: xがFloat.piならば、x.significandは２進数で1.10010010000111111011011です、それでx.significandWidthは23です。

source: If x is NaN, then x.significand is NaN.
ja: xがNaNならば、そのときx.significandはNaNです。

source: If x is infinite, then x.significand is infinity.
ja: xが無限ならば、そのときx.significandは無限大です。

source: If x is not a finite number, then x.ulp is NaN.
ja: xが有限数でないならば、そのときx.ulpはNaNです。

source: If x is very small in magnitude, then x.ulp may be a subnormal number.
ja: xが規模において非常に小さいならば、x.ulpはサブノーマル数かもしれません。

source: If x is zero, then x.exponent is Int.min.
ja: xがゼロならば、そのときx.exponentはInt.minです。

source: If x is zero, then x.nextDown is -leastNonzeroMagnitude.
ja: xがゼロならば、そのときx.nextDownは-leastNonzeroMagnitudeです。

source: If x is zero, then x.nextUp is leastNonzeroMagnitude.
ja: xがゼロならば、そのときx.nextUpはleastNonzeroMagnitudeです。

source: If x is zero, then x.significand is 0.0.
ja: xがゼロならば、そのときx.significandは0.0です。
